<?php
/*
 * Базовый класс для одного элемента списка вида: array [ 'id' : 'name' ]
 *
 */

// описание класса
abstract class ItemForSimpleTicketList {

	//------------------------------------------------------------------------------------------------------------------------------------------------------
	// свойства

	// базовые данные
	protected $id = null;		// ID			(id -> this)
	protected $name = null;		// Наименование		(string)

	//------------------------------------------------------------------------------------------------------------------------------------------------------
	// конструктор
	public function __construct( $id = null ) {

		if( $id ) {
			$this->setId( $id );
			$this->loadDataFromDB();
		}
	}

	//------------------------------------------------------------------------------------------------------------------------------------------------------
	// методы получения данных

	// ID (id -> this)
	public function getId() {
		return $this->id;
	}
	// Название (string)
	public function getName() {
		return $this->name;
	}

	//------------------------------------------------------------------------------------------------------------------------------------------------------
	// методы изменения данных

	// ID (id -> this)
	public function setId( $value ) {
		$this->id = $value;
		return $this;
	}
	// Название (string)
	public function setName( $value ) {
		$this->name = $value;
		return $this;
	}

	//------------------------------------------------------------------------------------------------------------------------------------------------------
	// загрузка данных из БД
	abstract public function loadDataFromDB();
}

